Дипломная_работа/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаЕжемесячнойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Дипломная_работа/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Дипломная_работа/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
	&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда

	ДобавлениеРеквизитов();	
		
КонецЕсли; 

КонецПроцедуры


 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// ВКМ Добавление доп. реквизитов на форму при выборе выида договора Абонентское обслуживание
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		ДобавлениеРеквизитов(); 
		
	Иначе УдалениеРеквизитов(); 
		
	КонецЕсли;	   
	
КонецПроцедуры       

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервере
  Процедура ДобавлениеРеквизитов()   
	  
	  
	  Если Элементы.Найти("ФормаВКМ_ДатаНачала")= Неопределено Тогда  
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_ДатаНачала", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачала"; 
		  
	  КонецЕсли;
	  Если Элементы.Найти("ФормаВКМ_ДатаОкончания")= Неопределено Тогда
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_ДатаОкончания", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";  
	  КонецЕсли;
	  Если Элементы.Найти("ФормаВКМ_СуммаЕжемесячнойПлаты")= Неопределено Тогда
		  
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_СуммаЕжемесячнойПлаты", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаЕжемесячнойПлаты";  
	  КонецЕсли;
	  
	  Если Элементы.Найти("ФормаВКМ_СтоимостьЧаса")= Неопределено Тогда
		  ПолеВвода = Элементы.Добавить("ФормаВКМ_СтоимостьЧаса", Тип("ПолеФормы"), ЭтотОбъект);
		  ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
		  ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";    
	  КонецЕсли;
   	  
КонецПроцедуры	 


 &НаСервере
 Процедура  УдалениеРеквизитов();  
	 
	 Если Элементы.Найти("ФормаВКМ_ДатаНачала")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_ДатаНачала);
	 КонецЕсли;	
	 Если Элементы.Найти("ФормаВКМ_ДатаОкончания")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_ДатаОкончания);
	 КонецЕсли;	
	 Если Элементы.Найти("ФормаВКМ_СуммаЕжемесячнойПлаты")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_СуммаЕжемесячнойПлаты);
	 КонецЕсли;	
	 Если Элементы.Найти("ФормаВКМ_СтоимостьЧаса")<> Неопределено Тогда
		 Элементы.Удалить(Элементы.ФормаВКМ_СтоимостьЧаса);
	 КонецЕсли;	
	 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
	 |	ДоговорыКонтрагентов.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания,
	 |	ДоговорыКонтрагентов.ВКМ_СуммаЕжемесячнойПлаты КАК ВКМ_СуммаЕжемесячнойПлаты,
	 |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧаса КАК ВКМ_СтоимостьЧаса
	 |ИЗ
	 |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	 |ГДЕ
	 |	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	 
	 Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	 
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	 
	 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		 Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_ДатаНачала) Тогда
			 Объект.ВКМ_ДатаНачала = Неопределено; 
			 
		 КонецЕсли;   
		 
		 Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончания) Тогда
			 Объект.ВКМ_ДатаОкончания = Неопределено;
		 КонецЕсли;  
		 
		 Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_СуммаЕжемесячнойПлаты) Тогда
			 Объект.ВКМ_СуммаЕжемесячнойПлаты = Неопределено;
		 КонецЕсли;  
		 
		 Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧаса) Тогда
			 Объект.ВКМ_СтоимостьЧаса = Неопределено;
		 КонецЕсли;  
		 
	 КонецЦикла;
	 
КонецПроцедуры	 

// ВКМ Добавление доп. реквизитов на форму при выборе выида договора Абонентское обслуживание

#КонецОбласти
